# Number Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProjectInfo..::..Number Property
ProjectInfo Class See Also
---
Get or Set the Project Number of the Project Information.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Number { get; set; }
```

Visual Basic
---
```text
Public Property Number As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Number {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
This property is used to get or set the Project Number of the Project Information.
# See Also
ProjectInfo Class
Autodesk.Revit.DB Namespace